app/Controllers/Auth.php

    public function proses_login()
    {
        // dd($_POST);
        $session = session();
        $userModel = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Cari user di database berdasarkan username
        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'awan'
 LIMIT 1