app/Controllers/Mahasiswa.php

    public function index()
    {
        if (session()->get('role') != 'mahasiswa') {
            return redirect()->to('/auth');
        }

        $presensiModel = new PresensiModel();
        $userId = session()->get('id_user');
        $tanggalHariIni = date('Y-m-d');

        $presensiHariIni = $presensiModel->where('user_id', $userId)
            ->where('tanggal', $tanggalHariIni)
            ->first();
---
SELECT *
FROM `presensi`
WHERE `user_id` = '8'
AND `tanggal` = '2026-04-11'
 LIMIT 1

    public function datang()
    {
        $presensiModel = new PresensiModel();
        $userId = session()->get('id_user');
        $tanggalHariIni = date('Y-m-d');

        $cek = $presensiModel->where('user_id', $userId)->where('tanggal', $tanggalHariIni)->first();

        if (!$cek) {
            $presensiModel->insert([
                'user_id'   => $userId,
                'tanggal'   => $tanggalHariIni,
                'jam_masuk' => date('H:i:s'),
                // Data ini sekarang pasti masuk karena view-nya udah bener
                'latitude'  => $this->request->getPost('latitude'),
                'longitude' => $this->request->getPost('longitude')
            ]);
---
SELECT *
FROM `presensi`
WHERE `user_id` = '8'
AND `tanggal` = '2026-04-11'
 LIMIT 1
INSERT INTO `presensi` (`user_id`, `tanggal`, `jam_masuk`, `latitude`, `longitude`) VALUES ('8', '2026-04-11', '15:30:00', '-7.81959439149074', '110.39887048193127')

    public function pulang()
    {
        $presensiModel = new PresensiModel();
        $userId = session()->get('id_user');
        $tanggalHariIni = date('Y-m-d');

        $cek = $presensiModel->where('user_id', $userId)->where('tanggal', $tanggalHariIni)->first();
---
SELECT *
FROM `presensi`
WHERE `user_id` = '8'
AND `tanggal` = '2026-04-10'
 LIMIT 1