app/Models/PresensiModel.php

SELECT `presensi`.*, `users`.`nama`, `users`.`jurusan`
FROM `presensi`
JOIN `users` ON `users`.`id` = `presensi`.`user_id`
WHERE `users`.`jurusan` = 'Informatika'
ORDER BY `presensi`.`tanggal` DESC
---
    public function getLaporanWithFilter($jurusan = null)
    {
        $builder = $this->select('presensi.*, users.nama, users.jurusan')
            ->join('users', 'users.id = presensi.user_id');

        // Kalau ada filter jurusan yang dipilih, tambahkan 'WHERE'
        if (!empty($jurusan)) {
            $builder->where('users.jurusan', $jurusan);
        }

        // Urutkan dari yang terbaru
        return $builder->orderBy('presensi.tanggal', 'DESC')
            ->findAll();